import React from 'react';
import './Episodes.css';
import Episode from '../Episode/Episode';
import pic from '../../pictures/cover.png';

import a from '../../pictures/a.mp3';
import m from '../../pictures/m.mp3';
import w from '../../pictures/w.mp3';
import l from '../../pictures/l.mp3';

 const songs = [
  {
    title: "Amir Edit - متكتف",
    description: "متكتف مهموم موجوع وضعيف وشجاع مليان أحلام وعشان مربوط مكسور وبكسر في المآديف وتفوت أيام وتمر سنين وانا حالي غريب انا مين انا مين مشدود في الساقية وعايش مبسوط وحزين ومحبط وجرئ ورزين مشدود في الساقية وعايش مبسوط وحزين ومحبط وجرئ ورزين",
    song: a,
  },
  {
    title: "Marwan Paplo - Control",
    description: "بابلو بيكاسو مع الـ ladies اسكوبار مع الأخصام مفيش في حياتي شماعة مفيش وقت للأعذار في الكهف بعيد عن الأنظار بحط رجلي على الكار بجري ولا حياء من الرادار جايبها أزميلي من الصفر صعب تلاقيني في يوم أعوجها زمان كنا نلعب على الأساتك حاليا بجيب البواكي وأستكها حياتي عاملة زي الفيلم فا مش محتاج إني أحبكها بشوط فيهم زي كارلوس وأنزه واحد زي بيكهام وصلت للقمة بفضل ربي مخدتش أي اختصار عشان كدا الفرق بينا باين حتى لو فقعتو كل بار دا دايسني ودا ينكشني وأنا محافظ عالوقار أصلي مش بتاع عيال مينفعش أبيف مع أطفال super saiyan زي جوكر بـ flex عليكو زي الليكرا هادي بس بردو loco ولساني زفر زي عترا على وضعي ودا بالفطرة الباقي دول عايشين في كذبة طالع ازميلي من الحضرة أحلا مسا على العزبة مجال مقلوب لوكالة دا بيلت ودا بيتكلم بادئها من العتالة لحد ما بقيت المعلم قولولهم النار تحرق اليمسكها وردة عليكو وقدروا إن الشغلة في بيتها يا ساقطة نفسك انت في اللقطة طب قولي إزاي وتخينكو مش حمل اللطشة فاطشة انت والبافة ازميلي فاطشة قولو لأي شب أصفر يريح يشد لحافه ويتغطى أما تيجي تركب الـ wave تستأذن بدل ما اجي أربطك من الطوق ملكمش عندي غير نعل الجزمة الصنف دا مبيجيش بالذوق بحرقهم من نصرة وتفة على المايك بـ spit بترول في الـ release دايما بتأخر بس كله تحت الكنترول ادوني سلاح وعدوا الـ scor جم الراب وأنا في عز النوم حد يقولي يا جدعان مين دول على قد إيدينا أصحابي مش ورطة متحزقش لا تمون هنا يسطا احنا وسطة منحتجش لوسطة مبضمش خلاص سبت البصمة لو الكلام مش REAL لساني مش هينطق بي خدي الفيزا العبي بيها بس قلبي مش هتخدية الرقم دا مش مقامي فا مضطر أكنسل الـ DEAL لازم أعوض الليالي السهرتها وانتوا نايمين",
    song: m,
  },
  {
    title: "Wegz - الدنيا ايه",
    description: "والُدنيا ايه غير كام جدع بمسي عليه غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah الُدنيا ايه غير كام جدع بمسي عليه غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah  والُدنيا ايه غير كام جدع بمسي عليه  غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah  الُدنيا ايه غير كام جدع بمسي عليه  غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah  إيدي طايلة وبتوصل  تعاديني، دُغري هتتحصر  M1000 وبتفصل  فيها أول متعصب  فيها تاني عـ الحامي، انا عـ المارد الألماني  فين الكُترة في الغفلة، الليلة بيقعوا واحد ورا التاني  زهقت من اللي فيها واللي فيها  جراوي مقدرش أأذيها، مقدرش أوسخ لبسي بيها  فـ منفضلها ومقضيها، ياما قولنا الجيهة واتشرفنا بيها  علمتني إزاي أبيعك، أشبح عـ المكنة السريعة  قديم في الشُغلة، راسك ماتودكش  سكتنا ألغاز، سراديب وراسك ماتكفكش  كله عندك على القد وعندي كله على الكف  بقبض قد كله بجد ومبيصرفش معايا حد  ولا فارق معانا، وعشان كده رازقانا  وزميلي هنودي في مين، كُلها شباب تعبانة  باخد الوحش في لفة، وبعدها بدخل حالة فيه حد بيقولي في ودني، مبحتاجش أكتب حاجة  والطين بيفكرني والماس بيذوقوا  Ballerina تحررني، والبوم بنسوقوا  جمهور بنشوقه، وانتوا غلابة والكار مش كاركم  مش هتعيشوا علشان أفكركم  والُدنيا ايه غير كام جدع بمسي عليه  غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah الُدنيا ايه غير كام جدع بمسي عليه غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah والُدنيا ايه غير كام جدع بمسي عليه غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah الُدنيا ايه غير كام جدع بمسي عليه  غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah  ومنافقين وقفولي عـ الغلطة، في عقولهم مرضى  زميلي، حسدوني على سر الخلطة زميلي، أطفال بفلوس ونفوذ وزميلي مش بنطق لو طالبة معايا أبطلها، أبطلها بس أنا مدورها  مش ناسي، عندي ميعاد ومليش في الخدعة  كنت حاسس إنها حلوة وكنا بنلعب  عجباني ومخترعها وهسجلها  ونفسي أجيبها كبس عالي وأعومها  عفريت عـ الفردتين، yeah، حافظ الكورنيش  سيبت الباقي مني بحكم أكل العيش  حقودين واخدة مني وش، انتوا شايفيني ايه؟  دلوقتي بسأل نفسي، الوحش ده كان فين؟  بس، لما الطبع بينزل دايمًا بنسى فاكر لما وقعت وبقوم أذكى  أيام تركي ومايو كانت أهدى  حال الدنيا غصب، بس وحشاني بنت القـ والُدنيا ايه غير كام جدع بمسي عليه غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah الُدنيا ايه غير كام جدع بمسي عليه غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah والُدنيا ايه غير كام جدع بمسي عليه غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah الُدنيا ايه غير كام جدع بمسي عليه غير كام حسود أودي عليه، معايا ما يكفي أجبي عليك، yeah",
    song: w,
  },
  {
    title: "Lecay - مش ده اللي اخترته",
    description: "نفسي أحكيلك على الي داير جوايا وانتِ مش معايا بس مش ده الي أختارته مش ده الي أختارته  وأنا نفسي أحكيلك على الي داير  وانتِ مش معايا  بس تقريبا مش ده الي أختارته مش ده الي أختارته فيه سنين من عمري بتتقص وبسيح وانا بستنى الرد ببقى فحاله ومبتخلصش بكره نفسي ومن غير قصد بقلب ف الي كان وانا هلكان مين يشدك لو الدنيا هداك؟  بتلف عداد  بس انا مش عداء  مفيش خطوات انا بمشي على الخطاوي  الأحداث اشارة معدتش المرة دي  في لحظة أنكسارك الكون بيبقى فاضي  انا ف خناقة مبتخلصش بالتراضي  هل انا راضي على اللي أنا فيه سؤال عمري ما لقيت إجابة ليه  كل حاجه بتحصل ف مفيش  لسه ناسي نفسي ومنستكيش  تاخدي الباقي من عمري لو فاضل فيه يوم  لو فاضلي ساعة هامشيها وأروح  بمثل ف مشهد الضيقة ف سطور  انا سنة ف الظلمة ودقيقة ف النور  انا نفسي الوقت ميفوتش  الحتة الي جوايا ليكي متموتش  بس بكتم ف قلبي ودماغي متقولش  كان نفسي مسكتش  نفسي أحكيلك على الي داير جوايا  وانتِ مش معايا  بس مش ده الي أختارته  (مش ده الي أختارته)  وانا نفسي أحكيلك على الي داير جوايا وانتِ مش معايا  بس مش ده الي أختارته  مش ده الي أختارته",
    song: l,
  }
 ];

const Episodes = () => {


  return (
    <div className='episodes'>

      <h1 className="episodes-h1">My Recent Episode</h1>

      {
        songs.map((song) => (
          <Episode picture={pic} title={song.title} description={song.description} song={song.song} />
        ))
      }

      {/* <Episode picture={pic} title="How to build Your Persolnal Resilience" description="How to build Your Persolnal ResilienceHow to build Your Persolnal Resilience" song={m} />

      <Episode picture={pic} title="How to build Your Persolnal Resilience" description="How to build Your Persolnal ResilienceHow to build Your Persolnal Resilience" song={w} />

      <Episode picture={pic} title="How to build Your Persolnal Resilience" description="How to build Your Persolnal ResilienceHow to build Your Persolnal Resilience" song={l} /> */}

    </div>
  )
}

export default Episodes